In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame(np.arange(1,13).reshape(3,4), index=list('abc'), columns=list('ABCD'))

In [4]:
df2 = pd.DataFrame(np.arange(1,13).reshape(4,3), index=list('bcde'),
columns=list('CDE'))

In [5]:
df1

   A   B   C   D
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [6]:
df2

    C   D   E
b   1   2   3
c   4   5   6
d   7   8   9
e  10  11  12

In [7]:
df3 = df1.mul(df2, fill_value=0)

In [8]:
df3

     A    B     C     D    E
a  0.0  0.0   0.0   0.0  NaN
b  0.0  0.0   7.0  16.0  0.0
c  0.0  0.0  44.0  60.0  0.0
d  NaN  NaN   0.0   0.0  0.0
e  NaN  NaN   0.0   0.0  0.0

In [9]:
#　pandas包中的isnull() 和 notnull()方法都可以用于判断数据是否为缺失值（ＮａＮ　或者　Ｎｏｎｅ），如果是缺失值，isnull() 返回值为True，notnull()返回值为Ｆａｌｓｅ

In [10]:
df3.isnull()

       A      B      C      D      E
a  False  False  False  False   True
b  False  False  False  False  False
c  False  False  False  False  False
d   True   True  False  False  False
e   True   True  False  False  False

In [11]:
df3.notnull()

       A      B     C     D      E
a   True   True  True  True  False
b   True   True  True  True   True
c   True   True  True  True   True
d  False  False  True  True   True
e  False  False  True  True   True

In [12]:
# 选出不是缺失值的数据
df3.B[df3.B.notnull()]

a    0.0
b    0.0
c    0.0
Name: B, dtype: float64

In [13]:
# 缺失值的填充
df4 = pd.DataFrame(np.random.rand(5,4), index=list('abcde'), columns=list('ABCD'))

In [14]:
df4

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.756083  0.625226
c  0.040117  0.425248  0.489753  0.890388
d  0.407977  0.335268  0.655206  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [19]:
df4.ix['c', 'A'] = np.NAN
df4.ix['b':'d', 'C'] = np.NAN

In [20]:
df4

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230       NaN  0.625226
c       NaN  0.425248       NaN  0.890388
d  0.407977  0.335268       NaN  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [21]:
df4.fillna(0)

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.000000  0.625226
c  0.000000  0.425248  0.000000  0.890388
d  0.407977  0.335268  0.000000  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [22]:
# 前一个观测填充,列方向上的
df4.fillna(method='ffill')

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.387308  0.625226
c  0.979414  0.425248  0.387308  0.890388
d  0.407977  0.335268  0.387308  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [23]:
# 后一个观测值填充,列方向下的
df4.fillna(method='bfill')

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.018348  0.625226
c  0.407977  0.425248  0.018348  0.890388
d  0.407977  0.335268  0.018348  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [25]:
# 后一个观测值填充, 行方向上
df4.fillna(method='backfill', axis=1)

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.625226  0.625226
c  0.425248  0.425248  0.890388  0.890388
d  0.407977  0.335268  0.560663  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [26]:
df4.fillna(method='backfill', axis=0)

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.018348  0.625226
c  0.407977  0.425248  0.018348  0.890388
d  0.407977  0.335268  0.018348  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [27]:
#连续的ＮａＮ值按照ｌｉｍｉｔ指定个数填充
df4.fillna(method='pad', limit=4)

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.387308  0.625226
c  0.979414  0.425248  0.387308  0.890388
d  0.407977  0.335268  0.387308  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [28]:
df4.fillna(method='pad', limit=2)

          A         B         C         D
a  0.162368  0.076158  0.387308  0.496984
b  0.979414  0.502230  0.387308  0.625226
c  0.979414  0.425248  0.387308  0.890388
d  0.407977  0.335268       NaN  0.560663
e  0.154087  0.430670  0.018348  0.143374

In [29]:
# 填充完的替代原ＤａｔａＦｒａｍｅｄ
df4.fillna('missing', inplace=True)

In [30]:
df4

          A         B          C         D
a  0.162368  0.076158   0.387308  0.496984
b  0.979414  0.502230    missing  0.625226
c   missing  0.425248    missing  0.890388
d  0.407977  0.335268    missing  0.560663
e  0.154087  0.430670  0.0183485  0.143374

In [31]:
# 缺失值的选择删除
# DataFrame.dropna(axis=0, how='any', trash=None)
# axis = 0 指删除包含缺失值的行，axis = 1指删除包含缺失值的列，默认为0
# how: how = any 表示只要有一个缺失值就删除该行（列），how = all表示只有当所有的元素都为缺失值时才删除该行或列，ｈｏｗ默认取值为ａｎｙ
# thresh 比如thresh=5表示只有当某行（列）缺失值的数量大于或等于５时删除该行或列，默认为Ｎｏｎｅ

In [32]:
df4.ix['c', 'A'] = np.NAN

In [33]:
df4.ix['b':'d', 'C'] = np.NAN

In [34]:
df4

          A         B          C         D
a  0.162368  0.076158   0.387308  0.496984
b  0.979414  0.502230        NaN  0.625226
c       NaN  0.425248        NaN  0.890388
d  0.407977  0.335268        NaN  0.560663
e  0.154087  0.430670  0.0183485  0.143374

In [35]:
df4.dropna(axis=1, thresh=3)

          A         B         D
a  0.162368  0.076158  0.496984
b  0.979414  0.502230  0.625226
c       NaN  0.425248  0.890388
d  0.407977  0.335268  0.560663
e  0.154087  0.430670  0.143374

In [36]:
df4.dropna(axis=1, how='all')

          A         B          C         D
a  0.162368  0.076158   0.387308  0.496984
b  0.979414  0.502230        NaN  0.625226
c       NaN  0.425248        NaN  0.890388
d  0.407977  0.335268        NaN  0.560663
e  0.154087  0.430670  0.0183485  0.143374

In [37]:
# 删除重复数据
df5 = pd.DataFrame({'c1':['apple'] * 3 + ['banana'] * 3 + ['apple'], 
'c2': ['a', 'a', 3, 3, 'b', 'b', 'a']})

In [38]:
df5

       c1 c2
0   apple  a
1   apple  a
2   apple  3
3  banana  3
4  banana  b
5  banana  b
6   apple  a

In [39]:
df5.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [40]:
df5.drop_duplicates()

       c1 c2
0   apple  a
2   apple  3
3  banana  3
4  banana  b

In [41]:
# 以上两种方法都是默认方法

In [42]:
df5.duplicated(['c2'])

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [43]:
df5.drop_duplicates(['c2'])

       c1 c2
0   apple  a
2   apple  3
4  banana  b